
[{"id":43,"datetime":"2015-07-03T20:00:00.000-05:00","link":"http://www.offbroadwaystl.com/event/864573-trip-daddys-20th-anniversary-st-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/864573","slug":"2015-07-03-off-broadway","created_at":"2015-06-10T21:09:05.548-05:00","updated_at":"2015-06-10T21:16:45.302-05:00","venue":{"name":"Off Broadway","address":"","coverimg":"/assets/images/venues/offbroadway.jpg"},"artists":[{"name":"The Trip Daddys","website":"","facebook":"","description":"","songs":[],"videos":[{"youtubeid":"gVaU_ul3N78","title":"The Trip Daddys @ Blueberry Hill St Louis"}]},{"name":"Old Capital Square Dance Club","website":"http://www.oldcapitalmusic.com/","facebook":"354674221480","description":"Old Capital Square Dance Club formed in 2005. Jesse McClary and lead guitarist Zach Anderson are the primary songwriters for this group; this band can churn them out. McClary can write when he needs to. It's rumored that Anderson has a backlog of something close to one hundred fifty songs. The two are great rivals and have been playing together since elementary school. McClary is known to silence audiences with his acoustic singing and playing alone, while Anderson continues to explore different guitar styles (being known for his bends, chicken pickin', and slide playing) and prolific approach to songwriting.\r\n\r\nInspiration is manifested from personal experiences and from the point of view of people to whom they are close. It appears these individuals have towed the line many times over, in this lifetime.\r\n\r\nOld Capital Square Dance Club plays a combination of mostly their original songs and occasionally a cover of artists such as Hank Williams, The Rolling Stones, Bob Dylan, Tom Petty, The Band, George Jones, Merle Haggard, The Byrds, etc.\r\n\r\n\"We can be a loud rock ’n’ roll band, and then there’s a mellower side that’s a more ‘countrified’ version,\" McClary says. \"We can easily adapt our music to the space.\" \r\n\r\nOther regular band members include former front man of Brain Regiment - the wise and steady Casey Babb on bass guitar; street musician, Drew Sheafor on guitar, harmonica, and vocals, and beautiful new drummer and multi-instrumentalist genius, who also is a solo artist under his own name, Zagk Gibbons. \r\n\r\nSome evenings include an additional fiddle and lap steel player as well as their beloved friend and pianist, Tim Sullivan. With seven players combined, Old Capital Square Dance Club becomes The Old Capital Orchestra. ","songs":[{"title":"Statue","soundcloud_url":null,"soundcloud_furl":"https://soundcloud.com/theloftsessions/old-capital-square-dance?in=theloftsessions/sets/old-capital-square-dance-club-the-loft-sessions","duration":"3:23"},{"title":"Gold Mine (The Loft Sessions)","soundcloud_url":"","soundcloud_furl":"https://soundcloud.com/theloftsessions/old-capital-square-dance-club","duration":"4:14"}],"videos":[{"youtubeid":"jzqA9Paef78","title":"Statue Guards"},{"youtubeid":"36KezoasGos","title":"Up The Walls And Down The Sides"}]}]},{"id":39,"datetime":"2015-07-02T19:00:00.000-05:00","link":"http://www.ciceros-stl.com/event/799699-brandon-maddox-matt-jordan-st-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/799699","slug":"2015-07-02-ciceros","created_at":"2015-06-10T20:40:06.203-05:00","updated_at":"2015-06-10T20:40:06.203-05:00","venue":{"name":"Ciceros","address":"","coverimg":""},"artists":[{"name":"Matt Jordan","website":"http://www.mattjordansongwriter.com/","facebook":"mattjordansongwriter","description":"Matt Jordan is an award winning songwriter and Nashville recording artist. Matt grew up in Eureka, MO and moved to Nashville at the age of 20.\r\n\r\nMatt blends his storytelling lyrics reminiscent of Bruce Springsteen, The Eagles and Tom Petty with modern sounds similar to Eric Church, Lee Brice and Kip Moore. In a country music genre where lyrics have seemingly been second priority in recent years, Matt brings meaning to his songs while still implementing the catchy sounds we scan our radio dials looking for today.\r\n\r\nDuring his time in Nashville, Matt has recorded two EPs with grammy-nominated producer, Sal Oliveri. The 'Nothing Like Home' EP is a 7 song demo EP, available for free download at www.noisetrade.com/mattjordan/nothing-like-home-ep. The 'Alive' EP is Matt's first ever full band EP and will be released in June of 2015.\r\n\r\nAfter just two years in Nashville, doors are opening up for Matt. He’s been writing with some of the best young talent in Nashville and working hand in hand with Taylor Swift’s former manager, Rick Barker. In the slow moving pendulum that is the music industry, Matt is determined to continue making waves fast","songs":[{"title":"For A Minute","soundcloud_url":null,"soundcloud_furl":"https://soundcloud.com/mattjordanmusic/for-a-minute-1","duration":"2:49"},{"title":"Dancing In The Kitchen","soundcloud_url":"","soundcloud_furl":"https://soundcloud.com/mattjordanmusic/dancing-in-the-kitchen?in=mattjordanmusic/sets/nothing-like-home-ep","duration":"2:49"}],"videos":[{"youtubeid":"_7H3emsI_fE","title":"My American Girl"}]},{"name":"Brandon Maddox","website":"http://www.brandonmaddoxmusic.com/","facebook":"brandonmaddoxmusic","description":"From sharing the stage with CMA nominee superstar Brett Eldredge, a recording featured in the Michael Ealy film Unconditional, acclaimed performances at clubs and festivals across the nation, to appearing on TV and radio shows in major markets and recordings produced by Doug Sisemore (Reba McEntire’s music director and band mate), recording artist/singer/songwriter Brandon Maddox has quickly established himself as one of country music’s rising stars. On the verge of breaking out nationally with his new recording The Bigger The Wheels, The Better The Man, the single has been selected as \"The Monster Truck Song of 2014.\" The go-to song that celebrates the country lifestyle, Brandon was named the \"2014 Lucas Oil Monster Truck Artist of the Year\" and will be performing at all Lucas Oil Monster Truck Nationals and 4 Wheel Jamboree events. In just a few short weeks, the song has garnered airplay and Brandon has been featured on TV and radio shows across the country including Fox TV’s Good Day Chicago, NBC's WRCB TV 3/Chattanooga, KARK 4/Little Rock \u0026 WMTV15/ Madison, WCRX/Chicago, WTHI/Terra Haute and KKYY 101.3 Country/ Sioux City. The recording is featured on Brandon's new CD EP release also titled The Bigger The Wheels which is co-produced by Doug Sisemore and is also backed by Reba McEntire’s band. The single and EP are now available for digital download on iTunes, Amazon.com, CDBaby \u0026 BiggerTheWheels.com and for purchase at Brandon's live performances. In just a short period of time Brandon is generating buzz in music circles with his performance on the nationally syndicated World Cafe on NPR. His recording Honk, If You're Country was featured in Michael Ealy’s feature film Unconditional. Brandon's debut EP Weightless (also produced by Doug Sisemore) generated radio action including US101 Chattanooga and CMG Radio Network, as well as critical and fan acclaim. His celebrated live performances have earned Brandon fans and have included memorable shows with one of country music's hottest performers CMA nominee Brett Eldredge (the #1 gold record Don't Ya’). Brandon was a featured performer at Nashville Center Stage during the 2013 CMA Fan Fare, Shawnee Riverfest and CRS Nashville 2014, in addition to major country venues and festivals across America. Keep your eyes and ears on this exciting, young triple threat singer/songwriter/musician. Brandon Maddox is part of the next wave of county music’s biggest stars.\r\n","songs":[{"title":"Who Knew","soundcloud_url":null,"soundcloud_furl":"https://soundcloud.com/brandon-maddox/who-knew","duration":"3:29"},{"title":"I Don't Dream In Color Anymore","soundcloud_url":"","soundcloud_furl":"https://soundcloud.com/brandon-maddox/i-dont-dream-in-color-anymore","duration":"3:24"}],"videos":[{"youtubeid":"UU0uSkzyMQk","title":"Picture Perfect"},{"youtubeid":"HqxgIvGQpkg","title":"The Bigger The Wheels The Better The Man"}]}]},{"id":40,"datetime":"2015-07-02T20:00:00.000-05:00","link":"http://www.ciceros-stl.com/event/865347-bootleggin-thursdays-three-st-louis/","ticketlink":"","slug":"2015-07-02-ciceros","created_at":"2015-06-10T20:50:42.357-05:00","updated_at":"2015-06-10T20:50:42.357-05:00","venue":{"name":"Ciceros","address":"","coverimg":""},"artists":[{"name":"Three Crooked Men","website":"http://www.threecrookedmen.com/","facebook":"threecrookedmen","description":"Three Crooked Men is an old-time string band based in St. Louis MO: Michael Banvard, fiddle; Sean Barth, banjo; Keith Dudding, guitar and mandolin.","songs":[],"videos":[]}]},{"id":41,"datetime":"2015-07-09T20:00:00.000-05:00","link":"http://www.ciceros-stl.com/event/865349-bootleggin-thursdays-pik-n-st-louis/","ticketlink":"","slug":"2015-07-09-ciceros","created_at":"2015-06-10T20:55:21.297-05:00","updated_at":"2015-06-10T20:55:21.297-05:00","venue":{"name":"Ciceros","address":"","coverimg":""},"artists":[{"name":"Pik'n Lik'n","website":"","facebook":"304223986356885","description":"A group of rockers met at the bar and restaurant, The Shanti, in the Soulard district of St. Louis, MO, and decided to pick unplugged and share their licks. Thus, the new grass band, Pik'nLik'n was born in 2001.","songs":[],"videos":[]}]},{"id":42,"datetime":"2015-07-02T20:00:00.000-05:00","link":"http://www.offbroadwaystl.com/event/864545-yankee-racers-farewell-show-st-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/864545","slug":"2015-07-02-off-broadway","created_at":"2015-06-10T20:59:36.320-05:00","updated_at":"2015-06-10T21:16:58.758-05:00","venue":{"name":"Off Broadway","address":"","coverimg":"/assets/images/venues/offbroadway.jpg"},"artists":[{"name":"Yankee Racers","website":"http://www.yankeeracers.net/","facebook":"yankeeracers","description":"Yankee Racers emerged in 2011 from disparate ends of St. Louis’ rock scene and Chicago’s jazz scene. Its prime movers, guitarist Curtis Brewer and pianist Nathan Jatcko, spent years playing together in various professional groups before making the decision to produce their own music. The original conception of Yankee Racers was to be a strong recording duo, melding every influence of their diverse past to create the music that they wanted to hear. The result of their first collaboration is Yankee Racers’ full-length album Duologue (Amerigo Records/January 2012). Brewer \u0026 Jactko composed and directed a collection of prominent Midwestern musicians who performed the vocal and instrumental parts created by the duo. Their songs ebb and flow through tortuous moments of loss and alienation, intermixed with descants of love and longing. Duologue shines as a conscious ode to the format of 1960’s American radio, where one song exudes the primal churn of the kinetic youth while the next conveys introspective warmth through serene melodies and timeless themes. More Joni Mitchell than Springsteen, more Jeff Buckley than Cobain, their sound pushes to be thoughtful in structure while retaining rock n’ roll accessibility.\r\n\r\nWith the explosive reception of their first release, Yankee Racers evolved into a dynamic live band utilizing Brewer as lead vocalist. Their touring band adds the boundless talents of acclaimed musicians Jerry Mazzuca (drums) and Chris Turnbaugh (bass). The strength and depth of their collective comes from each musician’s arsenal of experience and the uniqueness of their live show is in their unpredictability. Yankee Racers refined focus on writing with live performances in mind is highlighted in their upcoming release, due out May 2013.","songs":[],"videos":[{"youtubeid":"MxOvm2Sg2F0","title":"For Ever"},{"youtubeid":"DJpydPcipDY","title":"Yankee Racers @ MusicStar Norderstedt"}]},{"name":"brotherfather","website":"","facebook":"Brotherfather","description":"\"[John Krane's] new electric project, brotherfather, is a stone gem, like Paul Simon fronting a 90's Seattle band. \"Stick Around\" is one of 2012's best recordings. High Praise? Yep.\"\r\n- Evan Sult, Eleven Magazine (Oct 11, 2012)\r\n\r\n\"John Krane has had one of my favorite singing voices in STL for a couple of years now. If only he could meld that voice to thoughtful, powerful indie rock. Ah HA! Brotherfather's recorded version of \"Stick Around\" may be my favorite STL song this year...and I've STILL never seen 'em live!\"\r\n- Evan Sult, Eleven Magazine (Dec 13, 2012)\r\n\r\n\"Brotherfather, the new St. Louis band, rocks so f*cking hard. That is all.\"\r\n- Kentucky Knife Fight, Twitter (Feb 25, 2013)\r\n\r\n\"Stick Around\" is nominated for Best Local Single of the Past 12 Months in the Riverfront Times' 2013 Best of St. Louis.","songs":[{"title":"Stick Around","soundcloud_url":null,"soundcloud_furl":"https://soundcloud.com/elevenmusicmag/brotherfather-stick-around","duration":"3:46"}],"videos":[]}]}]