
[{"id":5,"datetime":"2015-05-01T00:03:00.000Z","link":"http://www.offbroadwaystl.com/event/779749-james-mcmurtry-st-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/778327?utm_medium=bks","slug":"2015-05-01-off-broadway","created_at":"2015-04-24T00:04:46.053Z","updated_at":"2015-04-24T00:04:46.053Z","venue":{"name":"Off Broadway","address":"","coverimg":"/assets/images/venues/offbroadway.jpg"},"artists":[{"name":"James McMurtry","website":"http://www.jamesmcmurtry.com/","facebook":"JamesMcMurtry","description":"The son of acclaimed author Larry McMurtry (Lonesome Dove, Terms of Endearment), James grew up on a steady diet of Johnny Cash and Roy Acuff records. His first album, Too Long in the Wasteland (released in 1989), was produced by John Mellencamp and marked the beginning of a series of acclaimed projects for Columbia and Sugar Hill. In 1996, McMurtry received a Grammy nomination for his Longform Music Video of Where'd You Hide The Body. 1997's It Had To Happen received the American Indie Award for Best Americana Album.\r\n\r\nIn 2004, McMurtry released the universally lauded Live in Aught-Three on Compadre Records. 2005's Childish Things garnered some of the highest critical praise of McMurtry's career and spent six weeks at No. 1 on the Americana Music Radio Chart in 2005 and 2006. In September 2006, Childish Things and \"We Can't Make It Here\" won the Americana Music Awards for Album and Song of the Year, respectively. McMurtry received more Americana Music Award nominations for 2008's Just Us Kids. This album marked his highest Billboard 200 chart position in more than 19 years.\r\n\r\nIn 2009, Live in Europe was released, capturing The McMurtry Band's first European tour and extraordinary live set. Along with seasoned band members Ronnie Johnson, Daren Hess, and Tim Holt, the disc features special guests Ian McLagan and Jon Dee Graham. Also, for the first time ever, video of the James McMurtry Band's live performance is available on the included DVD.\r\n\r\nThe poignant lyrics of his immense catalog still ring true today. In 2011, \"We Can't Make It Here\" was cited among 'The Nation's' \"Best Protest Songs Ever.\" Bob Lefsetz writes, \"'We Can't Make It Here' has stood the test of time because of its unmitigated truth.\"\r\n\r\nNever one to rest on his laurels, James McMurtry continues to tour constantly, and consistently puts on a \"must-see\" powerhouse performance. 'The Washington Post' noted McMurtry's live prowess: \"Much attention is paid to James McMurtry's lyrics, and rightfully so: He creates a novel's worth of emotion and experience in four minutes of blisteringly stark couplets. What gets overlooked, however, is that he's an accomplished rock guitar player. At a sold-out Birchmere, the Austin-based artist was joined by drummer Daren Hess and bassist Ronnie Johnson in a set that demonstrated the raw power of wince-inducing imagery propelled by electric guitar. It was serious stuff, imparted by a singularly serious band.\"\r\nJAMES McMURTRY LIVE IN EUROPE CD WITH BONUS DVD DOCUMENTS FIRST EURO TOUR WITH GUESTS IAN MCLAGAN AND JON DEE GRAHAM\r\nOn October 13, 2009, Lightning Rod Records released Live in Europe, a document of McMurtry's first European tour, on which, along with long-time band members Ronnie Johnson, Daren Hess, and Tim Holt, he was joined by keyboardist Ian McLagan and fellow Texas songwriting legend Jon Dee Graham. The set is available as a CD with a bonus DVD, or as a deluxe vinyl LP package with a CD and DVD insert. In early 2009, James McMurtry and his trio traveled overseas to play their first European tour. The guys played for enthusiastic crowds in Germany, Great Britain, Ireland, The Netherlands, Scotland and Belgium. Joining the band on keyboards for the tour was the legendary Ian McLagan (who also played on McMurtry's latest studio album, Just Us Kids). The best recordings from the Amsterdam, The Netherlands and Geislingen, Germany concerts were combined to create Live in Europe. The album includes a bonus DVD featuring performances from the Amsterdam show. This marks the first time fans will be able to purchase video footage of McMurtry live in concert. The deluxe vinyl version includes inserted copies of the CD and DVD. Fellow Austin-based songwriter Jon Dee Graham opened the shows and joins the band on a version of his tune \"Laredo\" on the bonus DVD.\r\nJAMES McMURTRY ALBUMS REISSUED: 'CHILDISH THINGS' \u0026 'LIVE IN AUGHT-THREE' \r\nOn February 1, 2011, two of James McMurtry's most popular albums, Childish Things and Live in Aught-Three were reissued by Lightning Rod Records. Live in Aught-Three has been remastered since its original 2004 release and will be available on vinyl for the first time. The deluxe double LP also includes a copy of the album on CD.","songs":[{"title":"Ain't Got A Place","soundcloud_url":"https://api.soundcloud.com/tracks/175891025/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/complicatedgame/03-03-aint-got-a-place","duration":"2:41"}],"videos":[{"youtubeid":"4bE3DVMwjfw","title":"How'm I Gonna Find You Now"},{"youtubeid":"IM_BjzDCDXs","title":"Copper Canteen"}]},{"name":"Max Gomez","website":"http://www.maxgomezmusic.com/","facebook":"maxgomezmusic","description":"The most northern of the New Mexico pueblos, the hamlet of Taos, sits approximately 7,000 feet above sea level. It is an hour and half drive north of Santa Fe, or rather, just remote enough to stave off the casually curious person. Fiercely independent, the town, steeped in natural beauty, has long attracted artists and freethinkers of every stripe. It is within this bouillabaisse of nature, art and spirituality that we encounter Max Gomez. A young singer-songwriter in the seasoned vein of Jackson Browne and John Prine, Gomez grew up splitting his time between the sloping mountains of Taos and, for a period, the rolling plains of Kansas. On his family’s ranch in Kansas, Gomez still lends a hand with chores but relishes the time he can spend out on the lake practicing the art of fly-fishing. But it is in Taos, where he was ultimately inspired to explore his art and the ethos behind it.\r\n\r\nThe son of an artisanal furniture craftsman, Gomez grew up watching his father, learning the tools of the trade while simultaneously learning his way around the frets of his guitar. The workmanlike quality of his songwriting carries over from his days spent in the woodshed through an economy of words, phrase and narrative. A blues enthusiast from an early age, the young Gomez immersed himself in the primordial Delta and traditional folk blues of Lead Belly, Big Bill Broonzy and, of course, Robert Johnson. Though 1,200 miles and decades removed from his Mississippi heroes, Gomez had his imagination to fill in the gaps. Having honed his chops on the blues, Max turned his interest to traditional American folk music; “I’m influenced by the old stuff,” Max admits. “To me, that’s the best music.” As the Harry Smith anthology gave way to contemporary masters Townes Van Zandt, Kris Kristofferson, Guy Clark and John Hiatt, so did Gomez's songwriting. “The songs I write are not real straightforward. You have to decode them. I like when the listener has to create their own story, rather than be told what’s happening.” In short, storytelling that oscillates between everyman poetics and enigma.\r\n\r\nIn the span of its ten songs, the Jeff Trott (Stevie Nicks, Sheryl Crow) produced Rule The World traverses varying themes of heartbreak, regret, young love, desperation and, ultimately redemption. \"Run From You\", the album’s first single and co-written with Trott, reveals Max’s story telling skills. Gomez explains, “Sometimes I refer to this one as an anti-love song. We all come across trouble and often take the wrong road even when we know we should turn back.\" With his smoky voice, Gomez sings of desperation for change on “Rule The World” and on \"Never Say Never\", young love is likened to a \"cool kiss in the August summer heat,\" as the protagonist laments its fleeting nature. While the LP's pop instincts are evident, Rule The World is balanced by Gomez's love of roots music; see the blues-driven \"Ball And Chain.\" \r\n\r\nWhile many young artists write songs with the mere intention of entertaining the masses, Max's songs are filled with the raw emotion and capture the spirit of those who came before him. In an age of ever increasing false fronts and posturing, it's rare to catch a glimpse of a soul bared. But that is exactly what Gomez has done. ","songs":[{"title":"Rule The World","soundcloud_url":"https://api.soundcloud.com/tracks/5832852/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/max-gomez/01-rule-the-world-mix8","duration":"3:53"},{"title":"You Get Me High","soundcloud_url":"https://api.soundcloud.com/tracks/5832760/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/max-gomez/you-get-me-high","duration":"3:43"}],"videos":[{"youtubeid":"cE2AVCOWO9I","title":"What It Means"}]}]},{"id":10,"datetime":"2015-05-02T20:00:00.000Z","link":"http://www.offbroadwaystl.com/event/802679-will-hoge-st-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/802679","slug":"2015-05-02-off-broadway","created_at":"2015-04-24T00:09:38.717Z","updated_at":"2015-04-24T00:09:38.717Z","venue":{"name":"Off Broadway","address":"","coverimg":"/assets/images/venues/offbroadway.jpg"},"artists":[{"name":"Will Hoge","website":"http://www.willhoge.com/","facebook":"willhoge","description":"GRAMMY-nominated recording artist Will Hoge catapulted into the national spotlight with the release of his top-selling single “Strong” which is featured on his newest album NEVER GIVE IN. Breaking into mainstream country, the critically-acclaimed singer-songwriter has penned Lady Antebellum's “Better Off Now (That You’re Gone),” and co-wrote the Platinum-selling No. 1 smash “Even If It Breaks Your Heart,” recorded by the Eli Young Band. His stage shows are equal parts sweat, charisma and rock \u0026 roll revival which has landed him coveted opening slots for Dierks Bentley, John Mellencamp, Pistol Annie’s, Shinedown and ZZ Top.The Nashville native is currently on the road playing headline shows nationwide and recently released his new single \"Middle of America.\"","songs":[{"title":"Founding Fathers","soundcloud_url":"https://api.soundcloud.com/tracks/58248110/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/willhoge/founding-fathers","duration":"3:42"},{"title":"Jesus Came To Tennessee","soundcloud_url":"https://api.soundcloud.com/tracks/58248112/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/willhoge/jesus-came-to-tennessee","duration":"4:59"}],"videos":[{"youtubeid":"0Xr2ez3-6YA","title":"Middle Of America"}]},{"name":"Emily Wallace","website":"http://emilywallacetunes.com","facebook":"EmilyWallaceTunes","description":"Emily Wallace is a folk singer/songwriter out of St. Louis.","songs":[],"videos":[{"youtubeid":"R57CavtWs3E","title":"Sweet Lorraine"},{"youtubeid":"1Uus2jNGlGg","title":"Emily Wallace presented by RAW:St. Louis"}]}]},{"id":9,"datetime":"2015-05-02T00:08:00.000Z","link":"http://www.firebirdstl.com/event/803901-hell-night-cathedral-fever-saint-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/803901","slug":"2015-05-02-the-firebird","created_at":"2015-04-24T00:08:42.199Z","updated_at":"2015-04-27T00:12:00.243Z","venue":{"name":"The Firebird","address":"","coverimg":""},"artists":[{"name":"Hell Night","website":"http://hellnightstl.bandcamp.com/","facebook":"hellnightus","description":"Music Band From St. Louis. Intrusive and uplifting. Dudes from these bands Tilts, Tre Serpenti, Troubadour Dali, Shame Club, The Blind Eyes, Animal Empty, and Pink LLoyd.","songs":[],"videos":[{"youtubeid":"O__2bTVmK1Y","title":"Hell Night [full set, live @ The Firebird, St. Louis, MO 2/21/15]"}]},{"name":"Cathedral Fever","website":"http://cathedralfever.bandcamp.com/","facebook":"cathedralfever","description":"After forming in 1971, proto-pornogrind ensemble Fetal Cadaver went through 666 line-up changes over the course of 4 decades, and in 2012, with no original members or talent left to their name, a new band moniker seemed to be in order.","songs":[],"videos":[{"youtubeid":"caJ88G1R1HA","title":"Monolithic Rapture"},{"youtubeid":"yUkS1bbqh3g","title":"Oblivion Bed"}]},{"name":"The Lion's Daughter","website":"http://thelionsdaughter.bigcartel.com/","facebook":"thelionsdaughter","description":"THE LION'S DAUGHTER was formed in 2007 by guitarist/vocalist Rick Giordano, drummer Erik Ramsier, and bassist Scott Fogelbach. The band was originally conceived out of a hatred for the insincere and uninspired fodder choking the mainstream metal scene. They take notes from a myriad of metal's extremes, but live by no musical limitations and are driven to please no audience but themselves. The band doesn’t play as if it simply wants to see the world end; it sounds like they want to be the ones to destroy it.\r\n\r\nSince their inception, THE LION'S DAUGHTER have built a reputation as a formidable live force, sharing the stage with High On Fire, Pig Destroyer, EYEHATEGOD, Torche, Misery Index, Nachtmystium, Dark Funeral, and more. Staying true to their underground ethic, the band have toured around the country on the backs of several independent releases. The band have won the St. Louis Riverfront Times reader's poll as \"Best Metal Band of the Year\" several times over.","songs":[],"videos":[{"youtubeid":"bDpAI_E2_T8","title":"Swann"},{"youtubeid":"mO_ZcUEL6_8","title":"Dead Earth"}]},{"name":"ThorHammer","website":"http://thorhammer.bandcamp.com/","facebook":"thorhammerstl","description":"Heavy metal, high-speed double bass, rampaging bass lines twin rhythm and lead attack and melodic soloing accompanied with harsh battlecries. We like to thrash.","songs":[],"videos":[{"youtubeid":"uBPT_MM5WHQ","title":"Blood Eagle"}]}]},{"id":8,"datetime":"2015-05-02T00:07:00.000Z","link":"http://www.thedemostl.com/event/804273-hannah-aldridge-st-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/804273","slug":"2015-05-02-the-demo","created_at":"2015-04-24T00:08:04.714Z","updated_at":"2015-04-27T00:40:25.197Z","venue":{"name":"The Demo","address":"","coverimg":""},"artists":[{"name":"Hannah Aldridge","website":"http://hannah-aldridge.com/","facebook":"HannahAldridgeOfficial","description":"Americana is the perfect concoction of American roots music that comprises our musical ethos as we know it today. It is something so engrained in our history, folklore, tradition, and mythology that it is not as simple as just \"becoming\" Americana, but rather, it is something that you are born into. It's that old cast-iron Coca-Cola sign that's been in your neighbor's shed for 50 years, a banjo and a Fender telecaster playing together, a 1955 Chevy with a modern stereo.\r\n\r\nThere are few artists that can truly encapsulate the essence and true range of Americana like Muscle Shoals artist Hannah Aldridge, whose musical pedigree precedes her and speaks for itself.\r\n\r\nHannah Aldridge is the daughter of Alabama Music Hall of Famer Walt Aldridge, who is one of the most prolific songwriters of the modern musical era. Twice named by Billboard magazine as one of the Top Country Songwriters of the year, ASCAP Songwriter of the Year, and countless Number One and Top Ten hits recorded by the likes of Lou Reed, Reba McEntire, Travis Tritt, Earl Thomas Conley, Ricky Van Shelton, Ronnie Milsap, and Conway Twitty.\r\n\r\nWith sounds ranging from blues in the Mississippi Delta to the dusty, dixieland jazz sounds from New Orleans, the musical stylings of Muscle Shoals on up to the primitive roots of American Country music, Hannah Aldridge leaves no inspiration or influence untapped. \r\n\r\n\"I think people have forgotten what real drums and real voices sound like. We have been so overexposed to these pre-packaged \"#1 hits\" that when there is anything that has any glimpse of truth or rawness to it, it is like a fresh breath of air. Americana music really is lyrically driven and is meant to make people think, which is the total opposite of most of the stuff out there on the radio, so I think that naturally people are being drawn towards it.\" says Aldridge.\r\n\r\nBesides being a seasoned staff songwriter for BAR Music with song placements in television shows like Hart of Dixie(CW) and recognition from American Songwriter as well as Relix Magazine, her vocal talents rarely go unrecognized, something that lends itself to being true to the Americana methodology of not using excessive \"talent-enhancing\" techniques in the studio or live. Both her natural and cultivated talent help her to emote with both listeners and musicians alike on a truly organic level.\r\n\r\nSeasoned by both life events and musical events since the release of her first EP, \"Wanderer\" in 2011, Hannah's upcoming release \"Born to be Broken\" shows a stark difference of growth in musical sensibility, writing, and maturity.\r\n\r\nHannah has toured all across the United States and Europe gaining a grassroots movement of fans that wait in silent adoration of the return of their Americana Heir Apparent Princess of Muscle Shoals.","songs":[{"title":"Lord Only Knows","soundcloud_url":"https://api.soundcloud.com/tracks/33963442/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/hannah-aldridge/lord-only-knows","duration":"3:35"},{"title":"Forest Fire Demo","soundcloud_url":"https://api.soundcloud.com/tracks/33962545/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/hannah-aldridge/forest-fire-demo","duration":"4:40"}],"videos":[{"youtubeid":"PzbjYNs7AAY","title":"Howlin' Bones"}]},{"name":"Old Capital Square Dance Club","website":"http://www.oldcapitalmusic.com/","facebook":"354674221480","description":"If Hank Williams, The Rolling Stones, Gram Parsons, and a few members of the Traveling Wilburys sat down and got to know each other for a few days, Old Capital Square Dance Club may emerge. With tone conscious guitar and layered harmonies OCSDC has a sound that congers all sorts of healing sounds and images.\r\n\r\n-A mixture of Rock and Roll and Country Rock\r\n-Loads of original material\r\n-Guitars, Piano, Bass, Drums, Harmonica, and Harmonies","songs":[{"title":"Gold Mine","soundcloud_url":"https://api.soundcloud.com/tracks/198010706/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/theloftsessions/old-capital-square-dance-club","duration":"4:14"},{"title":"Statue","soundcloud_url":"https://api.soundcloud.com/tracks/198010709/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/theloftsessions/old-capital-square-dance","duration":"3:23"}],"videos":[{"youtubeid":"jzqA9Paef78","title":"Statue Guards"}]},{"name":"Phoebe Elliot","website":"http://phoebeelliot.com/","facebook":"","description":"Nashville Pop songstress Phoebe Elliot broke into the music scene at age 4, harmonizing to Disney tunes in the back seat of the family minivan. After writing her first song at fifteen she knew right away she wanted to be an artist.  Elliot currently lives in Nashville and continues to write, perform and collaborate with other songwriters, musicians, and artists under the watchful eye of Grammy winning producer Paul Worley (Lady Antebellum, Dixie Chicks, Martina McBride).\r\n\r\nIn 2013, “Ghosts Roam This Town” won an Independent Music Award for best acoustic song.  More recently, “Beating Of My Heart” was featured as a Daily Discovery on AmericanSongwriter.com.\r\n\r\nPhoebe Elliot’s new album “Beating Of My Heart.” (due out October 7th) is the intimate sharing of this songwriter’s heart and soul.  Channeling a stream of sadness, joy and memories, it forms tumultuous rapids at times, serene mirror-like pools at others. Floating above like a subtle descant is an evocation of things to come.\r\n\r\nShe describes her new work as braver, more honest than what came before.  ”Some of the lyrics are especially raw,” she said, “but musically the new work plays by the rules.”  Still, it’s clear she’s not afraid to break the rules.  ”I’ve grown, lived longer.. I’ve had more experiences good and bad. I’ve taken time to reflect on the past.  But I’m still young, too, and hopefully and naive in many ways.”\r\n\r\nIn “Beating Of My Heart,” maturity tangoes with innocence, and we, the listeners are close enough to hear the dancers’ breath and feel their pulse.","songs":[{"title":"Leavin'","soundcloud_url":"https://api.soundcloud.com/tracks/172480762/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/phoebe-elliot/leavin","duration":"3:56"},{"title":"Come On In","soundcloud_url":"https://api.soundcloud.com/tracks/161153884/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/phoebe-elliot/come-on-in","duration":"3:50"}],"videos":[{"youtubeid":"mf54nGL6EpY","title":"Phoebe Elliot Live"}]}]},{"id":7,"datetime":"2015-05-02T00:05:00.000Z","link":"http://www.ciceros-stl.com/event/816815-bar-stage-matt-klose-st-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/816815","slug":"2015-05-02-ciceros","created_at":"2015-04-24T00:06:45.504Z","updated_at":"2015-04-27T01:10:57.910Z","venue":{"name":"Ciceros","address":"","coverimg":""},"artists":[{"name":"Matt Klose","website":"","facebook":"MattKloseMusic","description":"I am a musician, a guitarist, a songwriter. I sing, I take photos, I write in St. Louis Mo and abroad. this is Matt UP Klose, thank you for stopping by.","songs":[{"title":"The Fall","soundcloud_url":"https://api.soundcloud.com/tracks/46858061/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/stl-songwriters-anonymous/matt-klose-the-fall","duration":"3:12"}],"videos":[{"youtubeid":"uUpZD3OlT80","title":"Take Me There"}]}]},{"id":6,"datetime":"2015-05-02T00:04:00.000Z","link":"http://www.blueberryhill.com/events/indexeventcalendar.php","ticketlink":"http://www.ticketmaster.com/Duck-Room-at-Blueberry-Hill-tickets-St-Louis/venue/50280?tm_link=edp_Venue_Name_1","slug":"2015-05-02-blueberry-hill","created_at":"2015-04-24T00:05:48.037Z","updated_at":"2015-04-27T01:27:01.041Z","venue":{"name":"Blueberry Hill","address":"","coverimg":""},"artists":[{"name":"Alejandro Escovedo \u0026 The Sensitive Boys","website":"http://www.alejandroescovedo.com/","facebook":"alejandroescovedo","description":"There are songwriters who sing their songs, and then there are songs who sing their writers.\r\n\r\nAlejandro Escovedo is one with his muse and his music. Over a lifetime spent traversing the bridge between words and melody, he has ranged over an emotional depth that embraces all forms of genre and presentation, a resolute voice that weathers the emotional terrain of our lives, its celebrations and despairs, landmines and blindsides and upheavals and beckoning distractions, in search for ultimate release and the healing truth of honesty. Sometimes it takes the form of barely contained rage, the rock of punk amid kneeled feedback; sometimes it caresses and soothes, a whispery harmony riding the air of a nightclub room, removed from amplification, within the audience.\r\n","songs":[],"videos":[{"youtubeid":"Vu4BrzxfpUM","title":"Crooked Frame (on Late Night with Conan O'Brien)"},{"youtubeid":"0-eAU23yrnY","title":"I Was Drunk"},{"youtubeid":"Gd-wHWRkw34","title":"Man Of The World"}]}]},{"id":3,"datetime":"2015-05-01T17:00:00.000Z","link":"http://www.thedemostl.com//event/820027-jmsn-st-louis/","ticketlink":"http://www.thedemostl.com/https://www.ticketfly.com/purchase/event/820027","slug":"2015-05-01-the-demo","created_at":"2015-04-24T00:02:26.240Z","updated_at":"2015-04-27T02:28:29.479Z","venue":{"name":"The Demo","address":"","coverimg":""},"artists":[{"name":"JMSN","website":"http://www.iamjmsn.com/","facebook":"officialJMSN","description":"I come from Detroit.","songs":[{"title":"'Bout It","soundcloud_url":"https://api.soundcloud.com/tracks/180039114/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/iamjmsn/bout-it-1","duration":"6:34"},{"title":"My Way","soundcloud_url":"https://api.soundcloud.com/tracks/180039121/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/iamjmsn/my-way-1","duration":"5:23"}],"videos":[{"youtubeid":"G-ovWe6QOQ8","title":"The One"},{"youtubeid":"EnQTeuTAizs","title":"Love \u0026 Pain"}]},{"name":"Black James","website":"http://blackjamesmusic.tumblr.com/","facebook":"BlackJamesMusic","description":"","songs":[{"title":"850-629-SURF","soundcloud_url":"https://api.soundcloud.com/tracks/184690762/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/blackjamesmusic/850-629-surf-wav","duration":"3:04"},{"title":"Head Bang On A MountainTop","soundcloud_url":"https://api.soundcloud.com/tracks/173520629/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/blackjamesmusic/head-bang-on-a-mountaintop","duration":"5:10"}],"videos":[]},{"name":"Loren D","website":"","facebook":"","description":"","songs":[],"videos":[]}]},{"id":2,"datetime":"2015-05-01T20:30:00.000Z","link":"http://www.ciceros-stl.com/event/822381-jakes-leg-st-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/822381","slug":"2015-05-01-ciceros","created_at":"2015-04-24T00:01:29.788Z","updated_at":"2015-04-27T02:50:20.346Z","venue":{"name":"Ciceros","address":"","coverimg":""},"artists":[{"name":"Jake's Leg","website":"http://jakesleg.com/","facebook":"143448108892","description":"Jake’s Leg has been in existence in the St. Louis area for 35 years now. Although different players have come and gone in the band, its musical spirit and intent has remained. It was started as a duo by guitarist and vocalist, Randy Furrer and Tim Fahy in the mid-1970’s. Lead guitarist, Dave Casper, joined soon after. Joe Trunko (bass and vocals) joined in 1990, and Bill Noltkamper (keyboards and vocals) joined in 1991. The newest member of the band is Ryan Wilhite on drums/percussion (joined in 2005). \r\n\r\nOver the years, Jake’s Leg has played to thousands of people, cutting across age and lifestyle demographics. To say they copy the Dead would be a mistake. They tend to interpret the material with their own identity musically and emotionally. For instance, Dave Casper’s lead solos pay homage to Jerry Garcia, but also Pat Metheny, Carlos Santana and Miles Davis. This hybrid of styles ends up working into the music.\r\n\r\nThere is a distinct joy that takes place on any given evening that transcends the typical musical experience. Somewhat irrelevant is the band’s thought process to the outcome of a Jake’s Leg performance. It seems to simply happen. People leave their troubles or concerns at the door and slide happily into “fun”.\r\n\r\nJake’s Leg relies on the energy of its audience, which is an integral part of the musical experience. This ongoing dialogue between the musicians and the listener is a component of the successful journey the band has realized for over 35 years. If people find this unspoken conversation between the band and its audience a bit bewildering, a quote from a Dead bumper sticker says it all.....\r\n\r\n“If you have to ask, you wouldn’t understand”","songs":[{"title":"\"You Ain't Going Nowhere\" Live at KDHX ","soundcloud_url":"https://api.soundcloud.com/tracks/28706373/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/kdhx/jakes-leg-you-aint-going","duration":"4:02"}],"videos":[{"youtubeid":"ZS7EmJDUFik","title":"Jake's Leg @ The Gramophone"}]}]},{"id":1,"datetime":"2015-05-01T20:00:00.000Z","link":"http://www.blueberryhill.com/events/indexeventcalendar.php","ticketlink":"https://www.facebook.com/events/381860512016997/","slug":"2015-05-01-blueberry-hill","created_at":"2015-04-23T23:57:40.157Z","updated_at":"2015-04-27T02:51:26.664Z","venue":{"name":"Blueberry Hill","address":"","coverimg":""},"artists":[{"name":"Flying House","website":"www.flyinghouseband.com","facebook":"FlyingHouseMusicExperience","description":"Flying House is a modern pop/rock band with elements of of Brit-Pop, Classic Rock 'n roll, European and American Folk. Formed by James Ibur, Flying House is made up of members from St. Louis-based bands who were making waves in the 90's including Five of These, Bella Wolf, Giant Desert Gerbils, Mary's Dream and Cobalt Blue. The Flying House sound is both retro and modern borrowing flavors from late 60's psychedelic rock/pop and modern rock/pop.","songs":[],"videos":[]}]},{"id":34,"datetime":"2015-05-06T20:00:00.000Z","link":"http://www.offbroadwaystl.com/event/785177-drag-river-st-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/784347","slug":"2015-05-06-off-broadway","created_at":"2015-04-30T23:44:53.963Z","updated_at":"2015-04-30T23:44:53.963Z","venue":{"name":"Off Broadway","address":"","coverimg":"/assets/images/venues/offbroadway.jpg"},"artists":[{"name":"Drag the River","website":"http://www.dragtheriver.com/","facebook":"","description":"","songs":[],"videos":[{"youtubeid":"PNIR6jJTlJw","title":"Beautiful and Damned"},{"youtubeid":"72vTtESYixY","title":"Barroom Bliss"}]},{"name":"Daren Gratton","website":"https://darengratton.bandcamp.com/","facebook":"","description":"","songs":[],"videos":[]},{"name":"Bobby Stevens","website":"http://www.cdbaby.com/cd/bobbystevens","facebook":"bobbystevensisalive","description":"a little bit country, a bit more folk, some more rhythm and blues, a lot more rock n'roll... it' s life ya know... searching for the connections","songs":[],"videos":[{"youtubeid":"hLOhxBPh0GQ","title":"Alive!"}]},{"name":"Dan Johanning","website":"https://danjohanningmusic.bandcamp.com/music","facebook":"","description":"","songs":[],"videos":[]}]},{"id":35,"datetime":"2015-05-07T20:01:00.000Z","link":"http://www.offbroadwaystl.com/event/775889-ray-wylie-hubbard-st-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/775889","slug":"2015-05-07-off-broadway","created_at":"2015-05-01T00:02:26.427Z","updated_at":"2015-05-01T00:02:26.427Z","venue":{"name":"Off Broadway","address":"","coverimg":"/assets/images/venues/offbroadway.jpg"},"artists":[{"name":"Ray Wylie Hubbard","website":"http://www.raywylie.com/","facebook":"raywyliehubbard","description":"As a music lover of impeccable taste, odds are that you’re already looking forward to spending the better part of the next hour – and several more after that – getting rather obsessively familiar with this latest serving of song and groove from Ray Wylie Hubbard. Having no doubt played his last album, 2010’s A. Enlightenment, B. Endarkenment (Hint: There is no C.), to digital bits – and committed to memory such earlier chestnuts as Snake Farm, Growl, Eternal and Lowdown, Crusades of the Restless Knights, and maybe even everything else going all the way back to that 1975 Cowboy Twinkies LP that Hubbard himself would rather you forget – you probably can’t wait to tuck into The Grifter’s Hymnal and leisurely savor it from end to end.\r\n\r\nThis, of course, is how things should be. But a couple of variables could throw the above plan off the rails a bit. Suppose, for instance, that the damn Mayans were right, and what’s left of 2012 is all the time we have left, period. Or, maybe despite that aforementioned impeccable music taste, you’ve somehow managed to make it this far into the 21st century without ever hearing of this Hubbard fellow. Grim scenarios, yes, but fear not; because whether you’re short on time due to an impending apocalypse or simply need a tidy introduction to bring you up to speed, the opening track on The Grifter’s Hymnal, “Coricidin Bottle,” tells you everything you need to know in just under two minutes. What it tells you about The Grifter’s Hymnal is that the record rocks. And what it tells you about Ray Wylie Hubbard is, he’s the kind of scrapper poet with the devil-may-care wherewithal to write both “lay down a groove like a monkey getting’ off” and “shakes the mortal coil round my amaranthine soul” into the same song – and the lethal charm and chops to pull it off.\r\n\r\n“This really was a very special record to me,” Hubbard says. “It wasn’t easy, and some of it really was a struggle, but it was fun. I think each record to me has been a struggle in a way, and I like it that way. I like it that they’re all hard to do, because I think that makes them all have more value to me. It makes me kind of reach for a better part of myself. It keeps me from settling.”","songs":[{"title":"Chick Singer, Badass Rockin'","soundcloud_url":"https://api.soundcloud.com/tracks/187409279/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/ray-wylie-hubbard/chick_singer_badass_rockin","duration":"2:55"},{"title":"Without Love (we're just wasting time)","soundcloud_url":"https://api.soundcloud.com/tracks/43553507/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/ray-wylie-hubbard/without-love","duration":"3:46"}],"videos":[{"youtubeid":"dTz68xgocjA","title":"Stone Blind Horses"},{"youtubeid":"8-cFtSPIF4Q","title":"Screw You, We're From Texas"}]},{"name":"Ronnie Fauss","website":"http://ronniefauss.com/","facebook":"ronniefauss","description":"Ronnie Fauss grew up in the brutal Texas heat where 95 degrees often constitutes a nice night, and where a man may seek relief through the nearest watering hole or under the chords of a freshly-tuned guitar. Possessing a unique voice in the alt-country vein seamlessly stretching towards moments of Americana and folk, Fauss is both optimist and realist, chasing his dream girl down a long dirt road and lamenting the struggles of his friends and neighbors, which serve as a microcosm for the country at large.\r\n\r\nThe Dallas-based singer-songwriter announced his arrival on the scene with a string of EPs in 2009 \u0026 2010 (New Songs for the Old Frontier, I Can’t Make You Happy, Mulligan) that provided rough sketches of an artist stomping around in space until solid ground appeared beneath his feet. On I Am The Man You Know I’m Not, a gifted bare bones storyteller has emerged, singing in warm, personal tones accentuated by flourishes of electric guitars, fiddles, organs, and steel guitars.\r\n\r\nBaring the influence of John Prine and Steve Earle, Fauss’ songs excel with a remarkable economy of words and poignant, catchy hooks. The sparse, pastoral duet with Lilly Hiatt on Gram Parsons’ “Sin City,” an homage to the legends of Fauss’ sub-genre, is tempered by the uptempo, Neil Young-channeling “The Night Before the War.” Whether wandering around broken-hearted (“I Don’t See You”) or at relative peace (“Pistols in the Air”), Fauss eschews the whisky-guzzling country bad boy façade in favor of the genuine article.\r\n\r\nRecorded at BnG Studio in Nashville alongside producer Sigurdur Birkis (drummer for Will Hoge), I Am The Man You Know I’m Not is an 11-song testament to how far the alt-country sound has traveled from the classic Wilco and Uncle Tupelo records of the 90s. Fauss’ narratives explore present tense perils and the requisite hope for tomorrow, all while acknowledging that things could fall apart at any moment.","songs":[{"title":"Rainbow connection","soundcloud_url":"https://api.soundcloud.com/tracks/28217444/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/ronniefauss/rainbow-connection","duration":"5:03"},{"title":"Sabu Visits The Twin Cities Alone","soundcloud_url":"https://api.soundcloud.com/tracks/26638408/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/ronniefauss/4-sabu-visits-the-twin-cities","duration":"3:40"}],"videos":[{"youtubeid":"jrvtp0vd1yM","title":"Good Enough"},{"youtubeid":"qDVXVLlsfDY","title":"The Night Before The War"}]}]},{"id":36,"datetime":"2015-05-03T17:00:00.000Z","link":"http://www.ciceros-stl.com/event/830939-reverse-order-rum-luck-st-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/830939","slug":"2015-05-03-ciceros","created_at":"2015-05-01T00:13:02.340Z","updated_at":"2015-05-01T00:13:02.340Z","venue":{"name":"Ciceros","address":"","coverimg":""},"artists":[{"name":"Reverse Order","website":"http://www.sonicbids.com/reverseorder","facebook":"reverseorder","description":"Reverse Order is a powerful pop/rock band whose songs range from energetic teen anthems, to more intense rock tracks. John is the front man of the group and has the ability to captivate an audience of any size. You can feel the power in every note he sings and plays. Cruise is the drummer but one of his greatest assets is that he is able to take over lead vocals as well. His drumming style is powerful and energetic and he draws from Pop/Punk greats like Travis Barker and Jason Lancaster. Audiences go wild for Drew as he struts the stage giving a dynamic and high energy performance, and Frank's driving bass holds down the low end as he delivers a powerful performance.","songs":[{"title":"Waiting","soundcloud_url":"https://api.soundcloud.com/tracks/164019178/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/reverseorder/01-waiting","duration":"3:40"},{"title":"Everything Beautiful","soundcloud_url":"https://api.soundcloud.com/tracks/164019175/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/reverseorder/03-everything-beautiful","duration":"4:30"}],"videos":[{"youtubeid":"GmIbZOPD7zE","title":"Here Before"},{"youtubeid":"uFXvE0PSL1U","title":"Nothing Left To Give"}]},{"name":"This Is Our Dance","website":"http://www.reverbnation.com/thisisourdance1","facebook":"ThisisourDance","description":"This is Our Dance was formed in St. Louis Missouri back in 2008 by Davey Vaughn and Andy Tardino.TIOD is a pop/rock/electronic group (named after an old Elvis song). Put together by two ordinary guys with the passion to move ahead and bring music that can make people feel something real. In 2010 Andy Tardino Former guitarist) left to pursue other interest. Davey has kept this project going putting out an album and continuing live shows. This is Our Dance works everyday to achieve our goals and eventually rise to the rest. TIOD music is meant to express the way I feel about everyday, modern life, and the personal struggles everyone can relate to. ","songs":[],"videos":[]},{"name":"Taller Than Trees","website":"http://www.reverbnation.com/tallerthantrees1","facebook":"dontforgetyourroots","description":"St. Louis alternative rock band Taller Than Trees formed in late 2013. In that short time their name has continuously grown around the St. Louis scene.","songs":[],"videos":[]},{"name":"The Outsiders","website":"","facebook":"918Outsiders","description":"A collective of dancers, producers, Hip-Hop artists \u0026 DJs who always bring good vibes to any establishment we attend or perform at.","songs":[],"videos":[]}]},{"id":37,"datetime":"2015-05-05T19:30:00.000Z","link":"http://www.firebirdstl.com/event/817165-step-rockets-saint-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/817067","slug":"2015-05-05-the-firebird","created_at":"2015-05-01T00:29:19.733Z","updated_at":"2015-05-01T00:30:13.802Z","venue":{"name":"The Firebird","address":"","coverimg":""},"artists":[{"name":"Step Rockets","website":"http://www.steprockets.com/","facebook":"StepRockets","description":"Hailing from the Twin Cities, Step Rockets is an indie rock band exploring psychedelia, modern hooks, and worldly grooves. The foursome's sound could best be described as The Flaming Lips and The Clash playing at a MGMT party.\r\n\r\nA Step Rocket is a multi-stage firing rocket that discards used charges. The name aptly describes the groups willingness to meld new sounds and styles while borrowing from genres such as Electronic Dance Music, New Wave, and Reggae. It is a cosmic recycling of past, present, and future music aimed to defy description.\r\n\r\nWhile making a bid to be the first band to play on the moon, the group is currently working on their second single release \"Kisser\" while playing a variety of shows in the Mid-West and gearing up for their first tour this September. Look for monthly shows and Step Rockets debut track \"If You Tried\".","songs":[{"title":"Turning Tides","soundcloud_url":"https://api.soundcloud.com/tracks/188328069/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/steprockets/turning-tides-single","duration":"3:14"},{"title":"Phantom Flower","soundcloud_url":"https://api.soundcloud.com/tracks/169204533/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/steprockets/phantom-flower","duration":"3:33"}],"videos":[{"youtubeid":"Dpx3v3QFKvk","title":"Kisser"}]},{"name":"Royal Tongues","website":"https://soundcloud.com/royal-tongues","facebook":"royaltongues","description":"Royal Tongues is an alternative/pop duo out of Buffalo, NY comprised of Aaron Bonus and Justin Gammella. After writing and producing for other artists and film/tv the pair decided to debut their own project and launched Royal Tongues in Fall 2014.\r\n\r\nThe duo released their debut single \"The Balance\" much to the acclaim of several taste-maker blogs and found themselves on the Hype Machine charts in less than 24 hours. Neon Gold calls Royal Tongues a \"sync goldmine\" and \"primed to sear a hole right through alt-radio.\"\r\n\r\nWith influences ranging from Smallpools, Passion Pit and Grouplove, this sync-friendly pair have caught the ears of the music industry and fans alike and promise more to come moving forward.\r\n\r\n\"sync goldmine, primed to sear a hole through alt-radio\" ––Neon Gold \r\n\r\n\"With a sound poised for alt-radio and as sync-friendly as they come this is a big step in the right direction for this upstate NY duo\" ––Kick Kick Snare","songs":[{"title":"Higher","soundcloud_url":"https://api.soundcloud.com/tracks/191407350/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/royal-tongues/higher","duration":"4:08"},{"title":"Rollin' On","soundcloud_url":"https://api.soundcloud.com/tracks/186930823/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/royal-tongues/rollin-on","duration":"3:54"},{"title":"The Balance","soundcloud_url":"https://api.soundcloud.com/tracks/166230099/stream?client_id=5789d01da954d453a0b23c6fded8910f","soundcloud_furl":"https://soundcloud.com/royal-tongues/the-balance","duration":"3:54"}],"videos":[]}]},{"id":38,"datetime":"2015-05-07T19:30:00.000Z","link":"http://www.firebirdstl.com/event/781589-36-crazyfists-saint-louis/","ticketlink":"https://www.ticketfly.com/purchase/event/781589","slug":"2015-05-07-the-firebird","created_at":"2015-05-01T00:38:33.173Z","updated_at":"2015-05-01T00:38:33.173Z","venue":{"name":"The Firebird","address":"","coverimg":""},"artists":[{"name":"36 Crazyfists","website":"http://36crazyfists.net/","facebook":"36crazyfists","description":"Since forming 16 years ago, the band's released four records through three different labels, lost members to everything from the usual band in-fighting to fatal car crashes, and they've shared the road with the likes of Alice in Chains, Atreyu, Killswitch Engage, Chimaira, Diecast, God Forbid, Walls of Jericho, and Poison the Well. They've steadily made a name for themselves and faced several ups and just as many downs. But this summer, one of Alaska's finest exports will return to the vibrant metal scene it helped forge with 'Collisions and Castaways,' the band's fifth record and first since 2008's 'The Tide and Its Takers' became 36CF's only studio offering to open in Billboard's Top 200 Chart.\r\n\r\n'Collisions and Castaways,' the band's forthcoming second set for Ferret Music, was written and recorded between October 2009 and May 2010 and is scheduled for release July 27, 2010. It follows on the heels of last year's DVD outing, 'Underneath a Northern Sky,' and is the band's second straight effort to feature guitarist Steve Holt in the producer's chair and Andy Sneap handling the final mix, 'Collisions and Castaways' sees the band evolving into a three-piece unit following the 2008 departure of bassist Mick Whitney, who left the group to spend more time at home with his wife and children.\r\n\r\nInspired by legends like Metallica, Deftones, and Only Living Witness, 36 Crazyfists, who helped anchor the inaugural RockStar Mayhem Festival, first formed back in 1994, taking its moniker from the Jackie Chan flick of the same name. Several players came in and out of the fold (including bassist JD Stuart, who was killed in a 1996 crash) before the band's core was solidified well before 36CF inked its first label deal with Roadrunner Records. \r\n\r\nTaking inspiration from his own life, Lindow says songs like \"The Deserter,\" \"Anchors,\" \"Death Renames the Light,\" and \"In the Midnights,\" while vague in their lyricism, tackle a number of personal issues from the singer's past that he admits \"I may have swept under the rug.\" Some of the songs address the constant mistakes he'd made during his 20s, which he says were something of a daze.\r\n\r\n\"Its definitely about life, my life and possibly all our lives,\" Lindow says.","songs":[],"videos":[{"youtubeid":"dLkm-Bpkgv4","title":"Also Am I"},{"youtubeid":"LfyWmyEyeGY","title":"Marrow"}]},{"name":"As Each Second Fades","website":"http://www.aseachsecondfades.com/","facebook":"AsEachSecondFades2012","description":"Hardcore/metal band conceived in Nashville, Illinois in the summer of 2012... Prepare.","songs":[],"videos":[{"youtubeid":"t7DGhzDbkYs","title":"\"Song 3 Demo\""},{"youtubeid":"P1ZTHkaEpqU","title":"Egocentric Mutilation"}]},{"name":"The Faded Truth","website":"http://www.reverbnation.com/thefadedtruth","facebook":"thefadedtruth","description":"","songs":[],"videos":[{"youtubeid":"x_VmzgiXzYE","title":"(Round 3 Battle for Pointfest)"},{"youtubeid":"W0lK0Nm6Smc","title":"If Anyone Cares"}]}]}]